## Pandas Basics

In [1]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Mike'],
    'Age': [25, 30],
    'City': ['Taguig', 'Pasig']
})

df = [
    {'EmployeeID': 'E01', 'Work Environment': 4, 'Management': 5},
    {'EmployeeID': 'E02', 'Work Environment': 3, 'Management': 4},
    {'EmployeeID': 'E03', 'Work Environment': 5, 'Management': 3}
]

In [2]:
# Exercise
my_wish_list = pd.DataFrame({
    'Products': ['Ryzen 5 7600', 'MSI B650M-A ATX w/ Wi-Fi', 'Sapphire Pulse RX 7600 XT 16GB', 'Crucial Pro 32GB (2x16BM) DDR5 6000Mhz'],
    'Quantity': ['1', '1', '1', '1'],
    'Price': ['11,995', '10,895', '20,050', '7,299'],
    'Care of': ['Ron', 'Abbi', 'Princess', 'Ariston']
})

my_wish_list

                                 Products Quantity   Price   Care of
0                            Ryzen 5 7600        1  11,995       Ron
1                MSI B650M-A ATX w/ Wi-Fi        1  10,895      Abbi
2          Sapphire Pulse RX 7600 XT 16GB        1  20,050  Princess
3  Crucial Pro 32GB (2x16BM) DDR5 6000Mhz        1   7,299   Ariston

In [3]:
# Create a range of periods from a start to an end date
pd.date_range(start='2018-04-24', end='2018-04-27', periods=4)

DatetimeIndex(['2018-04-24', '2018-04-25', '2018-04-26', '2018-04-27'], dtype='datetime64[ns]', freq=None)

In [4]:
data = {
    'Product Name': ['A', 'B', 'C', 'A', 'B', 'A'],
    'Quantity Sold': [3, 2, 5, 4, 1, 2],
    'Sale Price': [10, 20, 10, 15, 20, 15]
}

sales_df = pd.DataFrame(data)
sales_df

  Product Name  Quantity Sold  Sale Price
0            A              3          10
1            B              2          20
2            C              5          10
3            A              4          15
4            B              1          20
5            A              2          15

In [5]:
sales_df['Total Revenue'] = sales_df['Quantity Sold'] * sales_df['Sale Price']

total_revenue = sales_df.groupby('Product Name')['Total Revenue'].sum()
print(total_revenue)
sales_df

Product Name
A    120
B     60
C     50
Name: Total Revenue, dtype: int64

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60
4            B              1          20             20
5            A              2          15             30

In [6]:
favorite_books = pd.Series(['Book 1', 'Book 2', 'Book 3'])
favorite_books

0    Book 1
1    Book 2
2    Book 3
dtype: object

In [7]:
sales_df

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60
4            B              1          20             20
5            A              2          15             30

In [8]:
# Indexing
sales_df['Product Name'][0:2]

0    A
1    B
Name: Product Name, dtype: object

In [9]:
sales_df.loc[[1,2]]

  Product Name  Quantity Sold  Sale Price  Total Revenue
1            B              2          20             40
2            C              5          10             50

In [10]:
# Integer Location
sales_df.iloc[1:3]

  Product Name  Quantity Sold  Sale Price  Total Revenue
1            B              2          20             40
2            C              5          10             50

In [11]:
sales_df[sales_df['Total Revenue'] >= 50]

  Product Name  Quantity Sold  Sale Price  Total Revenue
2            C              5          10             50
3            A              4          15             60

In [12]:
classes = ['Cat', 'Dog', 'Rabbit']
columns = ['A', 'B', 'C']
animal_df = pd.DataFrame([[5, 2, 0], [3, 3, 2], [0, 1, 11]], index=classes, columns=columns)
animal_df

        A  B   C
Cat     5  2   0
Dog     3  3   2
Rabbit  0  1  11

In [13]:
# Get labels of ([rows], [columns])
animal_df.loc[['Cat', 'Dog'], ['A']]

     A
Cat  5
Dog  3

In [14]:
# Gets integer locations of [rows, columns]
animal_df.iloc[1:3,0:2]

        A  B
Dog     3  3
Rabbit  0  1

## Filtering

In [15]:
reviews_data = {
    'ProductID': ['P1', 'P2', 'P3', 'P4', 'P5'],
    'Rating': [1, 3, 5, 1, 2]
}

reviews_df = pd.DataFrame(reviews_data)
reviews_df[reviews_df['Rating'] <= 3]

  ProductID  Rating
0        P1       1
1        P2       3
3        P4       1
4        P5       2

### Data Cleaning and Preprocessing

In [16]:
customer_data = {
    'Name': ['Alice', 'Mike', 'John'],
    'Email': ['alice@mail.com', None, 'John@mail.com'],
    'Signup Date': ['2024-04-03', '2024-03-03', '2024-04-01']
}

customer_df = pd.DataFrame(customer_data)
customer_df

    Name           Email Signup Date
0  Alice  alice@mail.com  2024-04-03
1   Mike            None  2024-03-03
2   John   John@mail.com  2024-04-01

In [17]:
customer_df['Email'].fillna('No email provided', inplace=True)
customer_df

C:\Users\Lettush\AppData\Local\Temp\ipykernel_13096\2538994570.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  customer_df['Email'].fillna('No email provided', inplace=True)

    Name              Email Signup Date
0  Alice     alice@mail.com  2024-04-03
1   Mike  No email provided  2024-03-03
2   John      John@mail.com  2024-04-01

In [19]:
customer_df['Signup Date'] = pd.to_datetime(customer_df['Signup Date'])
customer_df

    Name              Email Signup Date
0  Alice     alice@mail.com  2024-04-03
1   Mike  No email provided  2024-03-03
2   John      John@mail.com  2024-04-01

In [21]:
import numpy as np

sample_data = {
    'A': [1,2,np.nan,4],
    'B': [5,np.nan,np.nan,8],
    'C': [10,11,12,np.nan]
}

sample_df = pd.DataFrame(sample_data)
sample_df

     A    B     C
0  1.0  5.0  10.0
1  2.0  NaN  11.0
2  NaN  NaN  12.0
3  4.0  8.0   NaN

In [27]:
sample_df.fillna(sample_df.mean(), inplace=True)

## CSV and Excel

In [29]:
sample_df.to_csv('example.csv')
data = pd.read_csv('example.csv')
data

   Unnamed: 0         A    B     C
0           0  1.000000  5.0  10.0
1           1  2.000000  6.5  11.0
2           2  2.333333  6.5  12.0
3           3  4.000000  8.0  11.0

In [32]:
data.to_excel('exported_data.xlsx', sheet_name="Sheet1")

In [ ]:
# for text files
# df_txt = pd.read_csv('reviews.txt', sep="\t")
# df

In [34]:
# df_txt['Review Length'] = df_txt['ReviewText'].apply(len)
# df_txt.to_csv('review_lengths.txt', sep="\t", index=False)

In [43]:
review_lengths = pd.read_csv('review_lengths.txt', sep="\t")
review_df = pd.DataFrame(review_lengths)
review_df

  ProductID              ReviewText  Review Length
0        P1  This product is great!             22
1        P2        Could be better.             16
2        P1               Loved it!              9
3        P3    Not what I expected.             20
4        P2        Amazing product.             16

In [49]:
review_df['movie_names'] = ['Movie 1', 'Movie 2', 'Movie 3', 'Movie 4', 'Movie 5']

In [50]:
review_df.to_csv('new_reviews.txt', sep="\t", index=False)